Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The path of the file or directory.
ja: ファイルまたはディレクトリのパス。

source: The path of the file whose contents you want.
ja: それの内容をあなたが望むファイルのパス。

source: The path of the intended destination for the item in src Path.
ja: src Pathの中の項目に対する意図される行き先のパス。

source: The path or a file or directory that file Manager is about to attempt to link.
ja: file Managerがリンクを試みようとするパスまたはファイルまたはディレクトリ。

source: The path or a file or directory that file Manager is attempting to copy.
ja: file Managerがコピーを試みたパスまたはファイルまたはディレクトリ。

source: The path or a file or directory that manager is about to attempt to move, copy, rename, delete, or link to.
ja: file Managerが移動、コピー、名前変更、削除、またはそれへのリンクを試みようとするパスまたはファイルまたはディレクトリ。

source: The path or a file or directory to which file Manager is about to attempt to link.
ja: それに対してfile Managerがリンクを試みようとするパスまたはファイルまたはディレクトリ。

source: The path or a file or directory to which file Manager is attempting to copy.
ja: それに向けてfile Managerがコピーを試みたパスまたはファイルまたはディレクトリ。

source: The path that contains the item to be pointed to by the link.
ja: リンクによって指し示される項目を含んでいるパス。

source: The path that identifies the location where the link will be created.
ja: そこでリンクが作成される場所を識別するパス。

source: The path that specifies the item you wish to link to.
ja: あなたがそれに対してリンクすることを願う項目を指定するパス。

source: The path to a directory.
ja: ディレクトリへのパス。

source: The path to a file containing a representation of an array produced by the write(to File: atomically:) method.
ja: write(to File: atomically:)メソッドによって生成される配列の表現を含んでいるファイルへのパス。

source: The path to a file containing a string representation of an array produced by the write To File: atomically: method.
ja: write To File: atomically:メソッドによって生成される配列の文字列表現を含んでいるファイルへのパス。

source: The path to the attempted link location.
ja: 試みられたリンク位置へのパス。

source: The path to the current home directory..
ja: 現在のホームディレクトリへのパス。。

source: The path to the directory whose contents you want to enumerate.
ja: それの内容をあなたが列挙するのを望むディレクトリへのパス。

source: The path to the file or directory that the file manager is attempting to delete.
ja: ファイルマネージャが削除を試みているファイルまたはディレクトリへのパス。

source: The path to the file or directory that the file manager wants to copy.
ja: ファイルマネージャがコピーしようとするファイルまたはディレクトリへのパス。

source: The path to the file or directory that the file manager wants to move.
ja: ファイルマネージャが移動しようとするファイルまたはディレクトリへのパス。

source: The path to the file or directory that was the destination of the hard link.
ja: ハードリンクの行き先だったファイルまたはディレクトリのパス。

source: The path to the file or directory you want to move.
ja: あなたが移動することを望むファイルまたはディレクトリへのパス。

source: The path to the file, device, or named socket to access.
ja: アクセスするファイル、デバイス、または名前付きソケットへのパス。

source: The path to the file.
ja: ファイルへのパス。

source: The path to the home directory for the user specified by user Name.
ja: user Nameによって指定されたユーザのためのホームディレクトリへのパス。

source: The path to the program’s current directory.
ja: プログラムの持つ現在のディレクトリへのパス。

source: The path to which path should refer.
ja: それに対してpathが参照すべきパス。

source: The point in the current coordinate system to which you want to apply the matrix.
ja: 現在の座標システムでの点、それに対してあなたは行列の適用を望みます。

source: The pointer in the table that matches pointer (as defined by the is Equal callback function).
ja: テーブルの中のポインタで、pointerに合致するもの（is Equalコールバック関数によって定義されるとおりに）。

source: The position at which to insert the new element.
ja: そこで新しい要素が挿入されることになる位置。

source: The position at which to insert the new elements.
ja: そこで新しいいくらかの要素が挿入されるところの位置。

source: The position of the element to remove.
ja: 除去する要素の位置。

source: The position of the file pointer within the file represented by the receiver.
ja: レシーバによって表されるファイル内部のファイルポインタの位置。

source: The predefined miles unit is defined by a Unit Converter Linear with a coefficient of 1609 .34, which corresponds to the conversion ratio of miles to meters (1 mi = 1609.34 m); the predefined meters unit is defined by a Unit Converter Linear with a coefficient of 1 .0, because it’s the base unit.
ja: あらかじめ定義されるmiles単位は、Unit Converter Linearによってcoefficient（係数）の1609 .34を使って定義されます、それはマイルからメートルへの変換率に相当します（1 mi = 1609.34 m）；一方あらかじめ定義されるmeters単位は、Unit Converter Linearによってcoefficientとして1 .0を使って定義されます、なぜならそれが基本単位だからです。

source: The predicate against which to evaluate the receiving array’s elements.
ja: それに対して受け手側の配列の持つ要素を評価することになる述部。

source: The predicate must be a equivalence relation over the elements.
ja: 述部は要素に対して同値関係でなければなりません。

source: The predicate must be a strict weak ordering over the elements.
ja: 述部は、それら要素に対して厳密弱順序でなければなりません。

source: The predicate orders errors before successes and sorts the error responses by their error code.
ja: この述部はエラーを成功の前に並べて、そしてそれらエラー応答をそのエラーコードによってソートします。

source: The predicate which decides if an integer will be included in the result or not.
ja: ある整数が結果に含まれるか否かを決める述部。

source: The preferred filename for the file wrapper object.
ja: ファイルラッパーオブジェクトに対する優先ファイル名。

source: The preservation priority for the specified tag.
ja: 指定されたtagに対する維持優先度。

source: The principal class typically controls all the other classes in the bundle; it should mediate between those classes and classes external to the bundle.
ja: プリンシパルクラスは、たいていバンドルの中の全てのその他のクラスを制御します；それは、それらクラスとそのバンドルに関係のないクラスの間を調停すべきです。

source: The private subclasses of a class cluster substitute the name of their public superclass when being archived.
ja: あるクラスクラスタのプライベートなサブクラスたちは、アーカイブされている時にそれらのパブリックなスーパークラスの名前の代理を務めます。

source: The properties for the new cookie object, expressed as key value pairs.
ja: 新しいクッキーオブジェクトに対する、キー値ペアとして表されるプロパティ。

source: The properties of this class let you configure the calendar and specify the date and time units you want displayed in the resulting string.
ja: このクラスのプロパティは、あなたにカレンダーを構成設定させて、あなたが結果文字列で表示されるのを望む日付と時刻の単位を指定させます。

source: The properties of this class let you configure the calendar and specify the style to apply to date and time values.
ja: このクラスのそれらプロパティは、あなたにカレンダーを構成設定させて、日付と時刻値に適用するスタイルを指定させます。

source: The properties to be set in the copied object or objects.
ja: コピーされたオブジェクトまたは複数のオブジェクトに設定されることになるプロパティ。

source: The properties to be set in the new object.
ja: 新しいオブジェクトにおいて設定されるプロパティ。

source: The protocol object named by namestr, or nil if no protocol by that name is currently loaded.
ja: namestrによって名づけられるプロトコルオブジェクト、またはその名前が現在ロードされるプロトコルがないならばnil。

source: The protocol required as this method’s argument can be specified using the @protocol() directive:
ja: このメソッドの引数として要求されるプロトコルは、@protocol()指示文を使って指定されることができます：

source: The provided value determines whether the unit is plural or singular.
ja: 提供された値が、単位が複数形か単数形かを決定します。

source: The proxy object’s name is the string you assign to it in the Identifier field of the Interface Builder inspector window.
ja: プロキシオブジェクトの持つ名前は、Interface BuilderのインスペクタウインドウのIdentifier欄であなたが割り当てるその文字列です。

source: The quarter symbols for the receiver.
ja: レシーバに対する四半期シンボル。

source: The radix used by decimal numbers.
ja: 10進数によって使われる基数。

source: The range expression is converted to a concrete subrange relative to this collection.
ja: 範囲式は、このコレクションに関連するある具体的な下位範囲へ変換されます。

source: The range in the Data to copy.
ja: Dataの中の範囲、それをコピーすることになります。

source: The range in the data to replace.
ja: データのこの範囲を置換します。

source: The range in the data to set to 0.
ja: 0に設定することになる、データの中の範囲。

source: The range of absolute time values smaller can take on in larger at the time specified by date.
ja: dateによって指定される時間でより大きいものの中に入ることができる、より小さい絶対時間値からなる範囲。

source: The range of characters in the receiver to get.
ja: 取得することになるレシーバにおける文字の範囲。

source: The range of characters to replace.
ja: 置き換える文字範囲。

source: The range of indexes in the array within which to search for an Object.
ja: この配列のインデックスの範囲、その内部においてan Objectを捜すことになります。

source: The range of integers to include.
ja: 含むことになるいつくかの整数からなる範囲。

source: The range of the collection to be removed.
ja: 除去されることになるコレクションの範囲。

source: The range of the first match.
ja: 最初のマッチの範囲。

source: The range of the string to search.
ja: 捜す文字列の範囲。

source: The range of the string to test.
ja: 調べる文字列の範囲。

source: The range of this data in which to perform the search.
ja: このデータの範囲、そこにおいて検索を実行します。

source: The range of valid integer values is 0..<INT_MAX-1.
ja: 有効な整数値の範囲は、0..<INT_MAX-1 です。

source: The range to copy.
ja: コピーする範囲。

source: The range within the array to search for obj.
ja: 配列内のこの範囲をobjについて検索することになります。

source: The range {NSNot Found, 0} is returned if one of the capture groups did not participate in this particular match.
ja: 捕獲グループの１つがこの特定のマッチに関与しないならば、範囲 {NSNot Found, 0} が返されます。

source: The range, or nil if it could not be calculated.
ja: その範囲、またはそれが計算されなかったならばnil。

source: The reason for this precedence is performance.
ja: この優先順のわけは、性能です。

source: The receiver does not retain notification Observer.
ja: レシーバは、notification Observerを保持しません。

source: The receiver is initialized with open permissions: anyone can read, write, or modify the directory on disk.
ja: レシーバは、開放権限で初期化されます：ディスク上のディレクトリを誰もが読み、書き、または修正できます。

source: The receiver is not associated to a file-system node until you save it using write(to File: atomically: update Filenames:).
ja: レシーバは、あなたがそれをwrite(to File: atomically: update Filenames:)を使って保存するまでは、ファイルシステムノードに結び付けられません。

source: The receiver must be a list descriptor.
ja: レシーバはリスト記述子である必要があります。

source: The receiver must be an Apple event or Apple event record, both of which can contain parameters.
ja: レシーバは、１つのアップルイベントまたはアップルイベントレコードでなければなりません、その両方ともパラメータを含むことができます。

source: The receiver must be an Apple event or Apple event record.
ja: レシーバは、１つのアップルイベントまたはアップルイベントレコードでなければなりません。

source: The receiver must be an Apple event.
ja: レシーバは、ひとつのアップルイベントでなければなりません。

source: The receiver must be created by an init(file Descriptor:) message that takes as an argument a stream-type socket created by the appropriate system routine, and that is being listened on.
ja: レシーバは、init(file Descriptor:)メッセージによって作成されなければなりません、それは適切なシステムルーチンによって作成された、そしてそれの上で聞き耳を立てているストリーム型ソケットを引数としてとります。

source: The receiver's Apple event type code, as stored in the NSScript Class Description object for the object’s class.
ja: レシーバのアップルイベント型コード、そのオブジェクトのクラスに対してNSScript Class Descriptionオブジェクトに格納される。

source: The receiver's comment string.
ja: レシーバの持つコメント文字列。

source: The receiver's port list.
ja: レシーバの持つポートリスト。

source: The receiver's version.
ja: レシーバのバージョン。

source: The receiver, or another object to take the place of the object that was decoded and subsequently received this message.
ja: レシーバ、またはデコードされた後このメッセージを受け取ったオブジェクトに取って代わる別のオブジェクト。

source: The receiver.
ja: レシーバ。

source: The receiver’s forward Invocation: method can then choose to forward the message to another object.
ja: レシーバのforward Invocation:メソッドは、その時メッセージを他オブジェクトへ転送するほうを選びます。

source: The receiver’s HTTP status code.
ja: レシーバの持つHTTP状態コード。

source: The receiver’s bundle identifier.
ja: レシーバの持つバンドル識別子。

source: The receiver’s cache storage policy.
ja: レシーバの持つキャッシュストレージ方針。

source: The receiver’s cached data.
ja: レシーバの持つキャッシュされたデータ。

source: The receiver’s comment URL or nil if the cookie has none.
ja: レシーバの持つコメントURLまたはクッキーが全く持たないならばnil。

source: The receiver’s comment URL.
ja: レシーバの持つコメントURL。

source: The receiver’s comment string or nil if the cookie has no comment.
ja: レシーバの持つコメント文字列、またはクッキーがコメントを持たないならばnil。

source: The receiver’s cookie properties.
ja: レシーバの持つクッキープロパティ。

source: The receiver’s data.
ja: レシーバの持つデータ。

source: The receiver’s expiration date, or nil if there is no specific expiration date such as in the case of “session-only” cookies.
ja: レシーバの持つ有効期限、またはnil、もし特定の有効期限が存在しないならば、例えば “session-only” クッキーの場合など。

source: The receiver’s expiration date.
ja: レシーバの持つ有効期限。

source: The receiver’s name.
ja: レシーバの持つ名前。

source: The receiver’s path.
ja: レシーバの持つパス。

source: The receiver’s return ID (an integer value), or 0 if an error occurs.
ja: レシーバの持つリターンID（整数値）、またはエラーが起こるならば０。

source: The receiver’s return ID (the ID for a reply Apple event).
ja: レシーバの持つリターンID（ある返答アップルイベントに対するID）を返します。

source: The receiver’s transaction ID (an integer value), or 0 if an error occurs.
ja: レシーバの持つトランザクションID（整数値）、またはエラーが起こるならば０。

source: The receiver’s transaction ID, if any.
ja: レシーバの持つトランザクションID、もしあれば。

source: The receiver’s user info dictionary.
ja: レシーバの持つユーザ情報辞書。

source: The receiver’s value.
ja: レシーバの持つ値。

source: The receiver’s version.
ja: レシーバの持つバージョン。

source: The reference date.
ja: 基準日。

source: The regular expression of a type checking result.
ja: ある型チェック結果の正規表現。

source: The regular expression options that are applied to the expression during matching.
ja: マッチングの間にその表現に適用される正規表現オプション。

source: The regular expression pattern to compile.
ja: コンパイルする正規表現パターン。

source: The remaining range.
ja: 残っている範囲。

source: The removed element.
ja: 除去された要素。

source: The replacement bytes.
ja: 置換用バイト。

source: The replacement data.
ja: 置換用データ。

source: The replacement string is treated as a template, with $0 being replaced by the contents of the matched range, $1 by the contents of the first capture group, and so on.
ja: 置き換え文字列はテンプレートとしてみなされ、$0はマッチされた範囲の内容に、$1は最初の捕獲グループの内容等々によって取り替えられます。

source: The representation is useful for debugging only.
ja: この表現は、デバッグに対してのみ実用的です。

source: The requested number of elements to store.
ja: 依頼された格納される要素数。

source: The response to cache.
ja: キャッシュする応答。

source: The result can be negative only if the collection conforms to the Bidirectional Collection protocol.
ja: 結果は、そのコレクションがBidirectional Collectionプロトコルに準拠する場合に限り、負であることができます。

source: The result of adding backslash escapes to this string is "\\(N\\/A\\)".
ja: バックスラッシュエスケープをこの文字列に加える結果は、"\\(N\\/A\\)"。

source: The result of calculating the difference from start to end.
ja: 開始から終了までの差を計算した結果。

source: The result of executing the event, or nil if an error occurs.
ja: イベントの実行の結果、またはエラーが起こるならばnil。

source: The result of the single match.
ja: 一回のマッチの結果。

source: The result would then be 1:37am, if that does exist.
ja: 結果はそのとき1:37amになります、それが存在するならば。

source: The result would then be 3:00am, if that does exist.
ja: 結果はそのとき3:00amになるでしょう、もし存在するならば。

source: The resulting array consists of at most max Splits + 1 subsequences.
ja: 結果の配列は、多くともmax Splits + 1の下位シーケンスから成ります。

source: The resulting point after applying the receiver's transformations.
ja: レシーバの持つ変換を適用した後に結果として生じる点。

source: The resulting range is the range of the intersection of the integers in range with the index set.
ja: 結果の範囲は、rangeの中の整数の、このインデックス集合との交差からなる範囲です。

source: The resulting range will be is Empty if the intersection is empty.
ja: 交差が空ならば、結果の範囲はis Emptyです。

source: The resulting size after applying the receiver's transformations.
ja: レシーバの持つ変換を適用した後に結果として生じる大きさ。

source: The resulting subsequence does not include the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みません。

source: The resulting subsequence includes the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みます。

source: The results obtained with the two options can be quite different in runs of spaces and other non-word characters.
ja: ２つのオプションで得られる結果は、空白と他の非語文字の連続において、全く異なることがありえます。

source: The return ID to be set in the returned descriptor.
ja: 返される記述子の中に設定されるリターンID。

source: The return type of your block should be void.
ja: あなたのブロックの戻り型は、voidであるべきです。

source: The return value indicates whether any machine limitations were encountered in the addition.
ja: 戻り値は、何らかのマシン限界が加算において出くわされたかどうかを指し示します。

source: The return value of the forwarded message is returned to the original sender.
ja: 転送されたメッセージの戻り値は、元々の送り手（センダー）に返されます。

source: The returned array includes frameworks that are linked into an application when the application is built and bundles for frameworks that have been dynamically created.
ja: 返される配列は、アプリケーションがビルドされる時にアプリケーションへとリンクされるフレームワーク、そして動的に作成されるフレームワークのためのバンドルを含みます。

source: The returned dictionary of headers is configured to be case-preserving during the set operation (unless the key already exists with a different case), and case-insensitive when looking up keys.
ja: 返されるヘッダの辞書は、設定操作の間は大文字指定を保全（キーが既に異なる大文字指定で存在する場合を除き）するように、そしてキーを検索するときは大文字小文字を無視するように構成設定されます。

source: The returned object might be different than the original receiver.
ja: 返されるオブジェクトは、オリジナルのレシーバとは異なるかもしれません。

source: The returned object responds only to write(_:).
ja: 返されるオブジェクトは、write(_:)にのみ応答します。

source: The returned object responds to both read... messages and write(_:).
ja: 返されるオブジェクトはread...メッセージとwrite(_:)の両方に応答します。

source: The returned object responds to both NSFile Handleread... messages and write(_:).
ja: 返されるオブジェクトはNSFile Handleread...メッセージとwrite(_:)の両方に応答します。

source: The returned object will be of one of the specific sub-classes (NSUser Unix Task, NSUser Apple Script Task, and NSUser Automator Task), or nil if the file does not appear to match any of the known types.
ja: 返されるオブジェクトは、特定のサブクラス（NSUser Unix Task、NSUser Apple Script Task、そしてNSUser Automator Task）の１つという性質がある、またはファイルが何らかの既知の型に合致するように見えないならばnilでしょう。

source: The returned objects are in the ascending order of their indexes in indexes, so that object in returned array with higher index in indexes will follow the object with smaller index in indexes.
ja: 返されるオブジェクトはindexesの中のそれらインデックスの昇順になります、そのため返される配列においてindexesの中のより高いインデックスを持つオブジェクトは、indexesの中のより小さいインデックスを持つオブジェクトの後に来ます。

source: The returned objects or objects are then inserted into the container using key-value coding.
ja: 返されるオブジェクトまたは複数のオブジェクトは、それから「キー値」コーディングを使ってコンテナへと挿入されます。

source: The returned string is the same as if you configured and used a date formatter as shown in the following example:
ja: 返される文字列は、あなたが日付フォーマッタを以下の例において示すように構成設定して使用した場合と同じです：

source: The returned string may not contain exactly those components given in template, but may—for example—have locale-specific adjustments applied.
ja: 返される文字列は、templateにおいて与えられるそれら構成要素をきっちり含んでいないかもしれません、しかし — 例えば — ロケール特有の調整が適用されるかもしれません。

source: The root class of most Objective-C class hierarchies, from which subclasses inherit a basic interface to the runtime system and the ability to behave as Objective-C objects.
ja: たいていのObjective-Cクラス階層のルートクラス、そこからサブクラスは基本的なインターフェイスとObjective-Cオブジェクトとして振舞う能力を継承します。

source: The rotation angle, measured in degrees.
ja: 度数で計られる、回転角度。

source: The rotation angle, measured in radians.
ja: ラジアンで計られる、回転角度。

source: The runloop modes in which the connection accepted notification can be posted.
ja: 接続受理通知が投函されることが可能な実行ループのモード。

source: The runloop modes in which the data available notification can be posted.
ja: そこにおいてデータ利用可能通知が投函されることができる実行ループモード

source: The runloop modes in which the read completion notification can be posted.
ja: 読み込み完了通知が投函されることが可能な実行ループのモード。

source: The runtime system invokes this method whenever an object receives an a Selector message it can’t respond to or forward.
ja: ランタイムシステムは、あるオブジェクトが、それが応答または転送することができないa Selectorメッセージを受け取る時はいつでもこのメソッドを発動します。

source: The same principle applies to custom types made up of other custom types that are codable.
ja: 同じ原理は、コード化可能である他のあつらえの型から成り立っているあつらえの型に適用されます。

source: The scaling factor to apply to both axes.
ja: 利用法の軸に適用する拡大縮小因数。

source: The scaling factor to apply to the x axis.
ja: x軸に適用する拡大縮小因数。

source: The scaling factor to apply to the y axis.
ja: y軸に適用する拡大縮小因数。

source: The script URL.
ja: スクリプトURL。

source: The script source for the receiver.
ja: レシーバのスクリプトソース。

source: The search is shallow, and therefore does not return the contents of any subdirectories and does not traverse symbolic links in the specified directory.
ja: 検索は浅いです、そしてそれゆえ何らかの下位ディレクトリの内容を返しません、そして指定されたディレクトリの中のシンボリックリンクを辿りません。

source: The search path directory.
ja: 検索パスディレクトリ。

source: The second example passes 1 for the max Splits parameter, so the original string is split just once, into two new strings.
ja: ２番目の例は1をmax Splitsパラメータに渡します、それで元の文字列は一度だけ分割されて、２つの新しい文字列になります。

source: The second is the class to convert it to.
ja: ２番目のものは、それへと変換することになるクラス。

source: The second partition, numbers[p...], is made up of the elements that are greater than 30.
ja: ２番目の区画、numbers[p...]は、30より大きなものである要素から構成されます。

source: The selection range over which the change is to take place.
ja: 選択範囲、それに対して変更が行われます。

source: The selection range that will be used if the string is accepted or replaced.
ja: 選択範囲、それは文字列が受諾されるか置換されるならば使われます。

source: The selection range will always be set to the end of the text if replacement occurs.
ja: 選択範囲は、置換が発生するならば、常にテキストの終わりに設定されます。

source: The selector is still queued on the thread’s run loop and performed as soon as possible.
ja: セレクタは、やはりスレッドの実行ループ上でキューに加えられ、そして可能な限り早く実行されます。

source: The selector must be a valid and non-NULL.
ja: セレクタは、有効で非NULLでなければなりません。

source: The selector must be non-NULL and valid for the receiver.
ja: セレクタは、レシーバに対して有効で非NULLでなければなりません。

source: The selector named by a Selector Name.
ja: a Selector Nameによって名付けられるセレクタ。

source: The separate parts of a person's name, allowing locale-aware formatting.
ja: ある個人の名前の個々の部分、ロケール対応の書式設定を可能にします。

source: The sequence must be finite.
ja: シーケンスは有限でなければなりません。

source: The sequence of elements for the new collection.
ja: 新しいコレクションのための要素からなるシーケンス。

source: The sequence’s maximum element if the sequence is not empty; otherwise, nil.
ja: シーケンスが空でないならばシーケンスの最大の要素；そうでなければnil。

source: The sequence’s maximum element.
ja: シーケンスの最大の要素。

source: The sequence’s minimum element, according to are In Increasing Order.
ja: シーケンスの最小の要素、are In Increasing Orderによる。

source: The sequence’s minimum element.
ja: シーケンスの最小の要素。

source: The server delivers notifications matching this registration irrespective of whether suspended with an argument of true has been called.
ja: サーバはこの登録に合致する通知を配達します、suspendedが引数のtrueとともに呼び出されたかどうかに関わりなく。

source: The server does not queue any notifications with this name and object until suspended with an argument of false is called.
ja: サーバは、どんな通知でもそれの名前とオブジェクトを使って待ち行列に入れません、suspendedが引数falseとともに呼び出されるまでは。

source: The server holds all matching notifications until the queue has been filled (queue size determined by the server), at which point the server may flush queued notifications.
ja: サーバは全ての合致する通知を保持します、待ち行列がいっぱいになってしまうまで（待ち行列のサイズはサーバによって決定されます）、その時点でサーバは待ち行列に入れられた通知を一掃するかもしれません。

source: The server only queues the last notification of the specified name and object; earlier notifications are dropped.
ja: サーバは、指定された名前とオブジェクトの最後の通知を待ち行列に入れるだけです；それより前の通知は没にされます。

source: The shared NSScript Coercion Handler for the application.
ja: そのアプリケーションに共有されるNSScript Coercion Handler。

source: The shared cookie storage instance.
ja: 共有クッキーストレージインスタンス。

source: The shared file handle associated with the standard error file.
ja: 標準エラーファイルと結び付けられる共有ファイルハンドル。

source: The shared file handle associated with the standard input file.
ja: 標準出力ファイルと結び付けられた共有ファイルハンドル。

source: The shared file handle associated with the standard output file.
ja: 標準出力ファイルと結び付けられる共有ファイルハンドル。

source: The short quarter symbols for the receiver.
ja: レシーバに対する短い四半期シンボル。

source: The short standalone month symbols for the receiver.
ja: レシーバに対する短い単独動作型の月シンボル。

source: The short standalone quarter symbols for the receiver.
ja: レシーバに対する短い単独動作型の四半期シンボル。

source: The sign of the decimal.
ja: 10進数の符号。

source: The signature for handler should match the following:
ja: handlerに対するシグネチャは、以下に合致するべきです：

source: The significand of the decimal.
ja: 10進数の仮数。

source: The simplest way to define a custom unit is to create a new instance of an existing NSDimension subclass using the init(symbol: converter:) method.
ja: あつらえの単位を定義する最も単純な方法は、既存のNSDimensionサブクラスの新しいインスタンスをinit(symbol: converter:)メソッドを使って作成することです。

source: The simplest way to make a type codable is to declare its properties using types that are already Codable.
ja: ある型をコード化可能にするもっとも単純な方法は、既にCodableである型のどれかを使ってそれのプロパティを宣言することになります。

source: The size data to which you want to apply the matrix.
ja: サイズデータ、それに対してあなたは行列の適用を望みます。

source: The size is calculated from Source Type and buffer .count.
ja: サイズは、Source Type and buffer .countから計算されます。
